In [1]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [2]:
connection = "mysql+pymysql://root:#Lover4life@localhost/imdb_data"
engine = create_engine(connection)

In [3]:
create_database(connection)

In [4]:
database_exists(connection)

True

In [5]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [6]:
# create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]

In [7]:
# explode the column into different rows, and get a list of unique genres we will use later
exploded_genres = basics.explode('genres_split')
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [8]:
# Create tconst genres_split table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()

In [9]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [11]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [14]:
basics = basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres', 'genres_split'])

In [15]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

92669

In [16]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [17]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_basics LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [19]:
ratings = pd.read_csv('Data/title_rating.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       260
2  tt0000005            6.2      2550
3  tt0000006            5.1       175
4  tt0000007            5.4       798

In [20]:
key_len = ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary 
ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

#crate table
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

476888

In [22]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 171786 entries, 0 to 92668
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    171786 non-null  object
 1   genre_id  171786 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.9+ MB

In [23]:
# Calculate max string lengths for object columns
genre_len = title_genres['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns 
# Create a schema dictonary using Sqlalchemy datatype objects
genre_schema = {'tconst': String(genre_len + 1), 
    'genre_id': Integer()}

In [24]:
title_genres.to_sql('title_genres', engine, dtype = genre_schema, if_exists = 'replace', index = False)

171786

genre_lookup.info()

In [25]:
# Calculate max string lengths for object columns
gen_len = genre_lookup['Genre_Name'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns 
# Create a schema dictonary using Sqlalchemy datatype objects
gen_schema = {'genre_id': Integer(), 
    'genre_name': String(gen_len + 1)}
genre_lookup.to_sql('genres', engine, dtype = gen_schema, if_exists = 'replace', index = False)

26

tmdb_data

In [27]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb.head()

     imdb_id     revenue      budget certification
0  tt0118694  12854953.0    150000.0            PG
1  tt0118852         0.0         0.0             R
2  tt0119273         0.0  15000000.0             R
3  tt0119495         0.0         0.0             R
4  tt0120467     14904.0    120000.0             R

In [28]:
# Calculate max string lengths for objects and create schema
tmdb_len = tmdb['imdb_id'].fillna('').map(len).max()
cert_len = tmdb['certification'].fillna('').map(len).max()
tmdb_schema = {'imdb_id': String(tmdb_len + 1), 
    'revenue': Float(),
    'budget': Float(),
    'certification': String(cert_len + 1)}
tmdb.to_sql('tmdb_data', engine, dtype = tmdb_schema, if_exists = 'replace', index = False)

925

In [29]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

Showing Final Tables

In [30]:
pd.read_sql("SHOW TABLES;", engine)

  Tables_in_imdb_data
0              genres
1        title_basics
2        title_genres
3       title_ratings
4           tmdb_data